//Масиви та об'єкти:
//------------------------------------------------------------------------------------------//
/*Задача 1:
- Створити масив, наповнити його 10 елементами будь-якого типу, вивести кожен елемент в консоль*/

let array =[
    /*0*/ 'hello',
    /*1*/ 'owu',
    /*2*/ 'com',
    /*3*/ 'ua',
    /*4*/ 1,
    /*5*/ 10,
    /*6*/ -999,
    /*7*/ 123,
    /*8*/ 3.14,
    /*9*/ 2.7,
    /*10*/ 16,
    /*11*/ true,
    /*12*/ false]

console.log(
    array[0],
    array[1],
    array[2],
    array[3],
    array[4],
    array[5],
    array[6],
    array[7],
    array[8],
    array[9],
    array[10],
    array[11],
    array[12])
/*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*/






/*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*/

/*Задача 2:
- Створити 3 об'єкти які описують книги. Поля об'єкту : title, pageCount, genre.*/

let obj = [
    {
        title:'10 Заповідей Okten School',
        pageCount:345,
        genre:'Закони програмування'
    },

    {
        title:'5 Секретів Okten School',
        pageCount:304,
        genre:'Секрети програмування'
    },
    {
        title:'Рекомендації від Okten School',
        pageCount:298,
        genre:'Секрети програмування'
    },
]

console.log(obj);
/*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*/






/*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*/
/*Задача 3:
- Створити 3 об'єкти які описують книги. Поля об'єкту : title, pageCount, genre, authors.
 Поле "автори" - являється  масивом. Кожен автор має поля name та age.*/

let objs1 =
    {
        /*0*/ title:'10 Заповідей Okten School',
        /*1*/ pageCount:345,
        /*2*/ genre:'Закони програмування',
        /*3*/ authors:'Журавльов Сергій Сергійович'
    };

    let objs2 =
        {
            /*0*/ title:'5 Секретів Okten School',
            /*1*/ pageCount:304,
            /*2*/ genre:'Секрети програмування',
            /*3*/ authors:'Журавльов Сергій Сергійович'
    };


let objs3 =
    {
        /*0*/ title:'Рекомендації від Okten School',
        /*1*/ pageCount:298,
        /*2*/ genre:'Секрети програмування',
        /*3*/ authors:'Журавльов Сергій Сергійович'
    };


console.log(objs1,objs2,objs3);
/*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*/






/*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*/
/* Задача 4:
 Створити масив з 10 об'єктами які описують сутність "користувач".
 Поля: name, username, password. Вивести в консоль пароль кожного користувача */


let arrayobj = [

    /*0*/{
        name:'William',
        username:' WillTheConqueror',
        password:'William@2023'
    },
    /*1*/{
        name:'Emily',
        username:'EmilyEnchantress',
        password:'EmilyMagic!21'
    },
    /*2*/{
        name:'James',
        username:'JamesTheExplorer',
        password:'J4mesExpl0rer'
    },
    /*3*/{
        name:'Charlotte',
        username:'CharlotteCharm',
        password:'Ch@rlotteCharm$'
    },
    /*4*/{
        name:'Benjamin',
        username:'BenjiBreeze',
        password:'BenjiBreeze123'
    },
    /*5*/{
        name:'Olivia',
        username:'OliviaOracle',
        password:'Olivia*Oracle789'
    },
    /*6*/{
        name:'Alexander',
        username:'AlexAdventurer',
        password:'Alex_Adv3ntur3r'
    },
    /*7*/{
        name:'Sophia',
        username:'SophiaSerendipity',
        password:'Soph1aSerendipity!'
    },
    /*8*/{
        name:'Daniel',
        username:'DanielDreamer',
        password:'D@nielDreamer777'
    },
    /*9*/{
        name:'Isabella',
        username:'IsabellaInfinity',
        password:'Is@bellaInf1nity'
    },
]


/*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*--*-*/
/*
Логічні розгалуження:
- Є змінна х, якій ви надаєте довільне числове значення.
Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
(в першу, другу, третю или четверту частину години).
- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
- Користувач вводить або має два числа.
Потрібно знайти та вивести максимальне число з тих двох .
Також потрібно врахувати коли введені рівні числа.

- є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
 буде присвоювати змінній х значення "default"  якщо ви намагаєтесь присвоїти в неї falsy-значення (хибноподібні, тобто ті, які приводиться до false, а це 0 null undefined і тд).


- з файлу arrays.js (лежить в папці 2023 plan ) взяти масив coursesAndDurationArray. За допомоги іф перевірити кожен його елемент на тривалість навчання. У випадку якщо тривалість довша за 5 місяців вивести в консоль "Супер".*/